ftkalcevic/DCC/STM32F469_Controller/Source/TouchGFX/Core/Src/main.c
				    }

				    f_close(&file);
			    }
			#endif
		}
	}
	
	for (;;)
	{
		HAL_GPIO_TogglePin(LED1_GPIO_Port, LED1_Pin);
		osDelay(pdMS_TO_TICKS(100));
		HAL_GPIO_TogglePin(LED2_GPIO_Port, LED2_Pin);
		osDelay(pdMS_TO_TICKS(100));
		HAL_GPIO_TogglePin(LED3_GPIO_Port, LED3_Pin);
		osDelay(pdMS_TO_TICKS(100));
		HAL_GPIO_TogglePin(LED4_GPIO_Port, LED4_Pin);
		osDelay(pdMS_TO_TICKS(100));
	}
	
  /* Infinite loop */
  vTaskDelete(NULL);

  /* USER CODE END InitialiseTask_Entry */
}

 /**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */
	else if (htim->Instance == TIM8)
	{
	    HAL_TIM_PWM_Stop(&htim8, TIM_CHANNEL_2);
	}
  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
